#+TITLE: HiveMind
* Moving to react
End goal: Single Page application

Port components
Make everything as declerative as possible

First: bare bones
-> modularise

Logic:
- Select Stones
- Drop Selection
- Websockets
  - Chat

Backend
- Validator

- Life game view
- update state / update actions
- websockets redirect
- Open rooms -> join

Profile -> passportjs
profile page, stats

elo system

notation?

time control

reset Camera Button

* Techs
- Create-react-app
- Typescript
- react
  + react-spring
  + three-fiber
  + Formik
- Socket.IO
- Express

* Content
Tutorial: The rules
How the stones can move

Add
- Fix beetle
- mosquito
- marienkäfer


* Styling
** Use components framework
Bootstrap? semantic?
Brutalistic
** Animations
on-hover -> show all possible
Drag stones ?
*** * React spring

** Customize style

* Dev practices
** Use git more
** Add tests

* Wishlist
** AI
*** Steal from chess?


* Log
** <2021-08-09 Mon>
:LOGBOOK:
CLOCK: [2021-08-09 Mon 16:56]--[2021-08-09 Mon 19:53] =>  2:57
CLOCK: [2021-08-09 Mon 16:49]--[2021-08-09 Mon 16:53] =>  0:04
CLOCK: [2021-08-09 Mon 16:13]--[2021-08-09 Mon 16:49] =>  0:36
:END:
- Canvas size
- DropMenu
  - State -> stones for each team
